---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipingSystem.IsHydraulicLoopBoundary(Autodesk.Revit.DB.Element)
source: html/7b33e27d-98c2-82de-2dd8-a2c4969e09e3.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystem.IsHydraulicLoopBoundary Method

Checks if the element is a valid hydraulic loop boundary.

## Syntax (C#)
```csharp
public static bool IsHydraulicLoopBoundary(
	Element element
)
```

## Parameters
- **element** (`Autodesk.Revit.DB.Element`) - The element to be checked.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null